ci4_att/app/Controllers/HotelesController.php

    public function index(): string
    {
        $hoteles = new HotelesModel();
        $datos ['datos']=$hoteles->findAll();
---
SELECT *
FROM `hoteles`

     public function eliminarHoteles($id=null){
       echo $id;
       $hoteles = new HotelesModel();
       $hoteles->delete($id);
---
DELETE FROM `hoteles`
WHERE `hotel_id` IN ('1')